Revit 2023 API
MassEnergyAnalyticalModel.MassId Property
 The ElementId of the mass instance the MassEnergyAnalyticalModel is associated with.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2012
Syntax
C#
public ElementId MassId { get; }
Visual Basic
Public ReadOnly Property MassId As ElementId
	Get
Visual C++
public:
property ElementId^ MassId {
	ElementId^ get ();
}
See Also
MassEnergyAnalyticalModel Class
Autodesk.Revit.DB.Analysis Namespace